In [2]:
import numpy as np
import pandas as pd
# Níveis de Índice
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [3]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [8]:
df = pd.DataFrame(np.random.randn(6, 2), index=hier_index, columns = ['A', 'B'])

In [9]:
df

             A         B
G1 1 -0.745567  0.369558
   2 -1.537778 -0.385268
   3 -0.363118 -0.965688
G2 1  1.479523 -2.382278
   2  0.617925  1.763046
   3 -2.014168  0.645684

In [10]:
df.loc['G1']

          A         B
1 -0.745567  0.369558
2 -1.537778 -0.385268
3 -0.363118 -0.965688

In [11]:
df.index.names

FrozenList([None, None])

In [12]:
#nomeando as listas de nomes para cada nível
df.index.names = ['Grupo', 'Número']

In [13]:
df

                     A         B
Grupo Número
G1    1      -0.745567  0.369558
      2      -1.537778 -0.385268
      3      -0.363118 -0.965688
G2    1       1.479523 -2.382278
      2       0.617925  1.763046
      3      -2.014168  0.645684

In [16]:
df.xs('G1')

               A         B
Número
1      -0.745567  0.369558
2      -1.537778 -0.385268
3      -0.363118 -0.965688

In [17]:
#usando somente os indices da primeira linha para cada grupo
df.xs(1, level='Número')

              A         B
Grupo
G1    -0.745567  0.369558
G2     1.479523 -2.382278

In [21]:
#aula sobre dados ausentes
d= {'A':[1, 2, np.nan], 'B':[5, np.nan, np.nan], 'C':[1, 2, 3]}

In [22]:
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [23]:
df = pd.DataFrame(d)

In [24]:
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [25]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [26]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [ ]:
#houve perda de dados utilizando a técnica acima

In [27]:
df.dropna(thresh=2)
#excluiu-se somente as linhas com 2 valores faltantes

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [29]:
#preenchendo os valores faltantes com zeros
df.fillna(0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [32]:
#substituindo os nan por média de algum valor 
#dentro do data frame
df.fillna(value=df['A'].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3

In [33]:
#note que nenhuma das substituições fez real substituição
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [34]:
#substituição de nan pelo valor anterior da linha acima
df.fillna(method='ffill')

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

In [2]:
#aula sobre entrada e saída de dados
import numpy as np
import pandas as pd

In [4]:
df= pd.read_csv('exemplo.csv', sep=',')
#CSV= Comma separated value
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [5]:
df = df  + 1

In [7]:
df

   Unnamed: 0   a   b   c   d
0           1   1   2   3   4
1           2   5   6   7   8
2           3   9  10  11  12
3           4  13  14  15  16

In [8]:
df.to_csv('exemplo.csv', sep=';', decimal=',')

In [13]:
df = pd.read_excel('Exemplo_Excel.xlsx', sheet_name='Sheet1')

In [15]:
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [17]:
df.to_excel('Exemplo_Excel.xlsx', sheet_name='Sheet1')

In [21]:
df = pd.read_html('https://pt.wikipedia.org/wiki/Nvidia#s_3D')

In [23]:
type(df)

list

In [24]:
len(df)

14

In [29]:
df[1]['Nvidia Corporation']

0     Sediada em Santa Clara em 2018
1                               Tipo
2                             Slogan
3                            Cotação
4                          Atividade
5                           Fundação
6                       Fundador(es)
7                               Sede
8                 Área(s) servida(s)
9                         Presidente
10                     Pessoas-chave
11                        Empregados
12                          Produtos
13                            Marcas
14                      Subsidiárias
15                             Lucro
16                             LAJIR
17                       Faturamento
18                   Website oficial
Name: Nvidia Corporation, dtype: object